Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: # Aligned with opening delimiter foo = long_function_name(var_one, var_two, var_three, var_four)
ko: # 구분자를 사용하여 정렬하기 foo = long_function_name(var_one, var_two, var_three, var_four)

source: # Arguments on first line forbidden when not using vertical alignment foo = long_function_name(var_one, var_two, var_three, var_four)
ko: # 수직 정렬을 하지 않는다면, 인수를 첫 번째 줄에 사용하지 마라. foo = long_function_name(var_one, var_two, var_three, var_four)

source: # Extra indentation is not necessary. foo = long_function_name( var_one, var_two, var_three, var_four)
ko: # 부가적인 들여쓰기는 딱히 사용하지 않아도 된다. foo = long_function_name( var_one, var_two, var_three, var_four)

source: # Further indentation required as indentation is not distinguishable def long_function_name( var_one, var_two, var_three, var_four): print(var_one)
ko: # 다음 행과 구별이 안 되므로 추가적인 들여쓰기가 필요하다. def long_function_name( var_one, var_two, var_three, var_four): print(var_one)

source: # More indentation included to distinguish this from the rest. def long_function_name( var_one, var_two, var_three, var_four): print(var_one)
ko: # 나머지 코드와의 구별을 위해 추가적인 들여쓰기를 사용했다. def long_function_name( var_one, var_two, var_three, var_four): print(var_one)

source: (Let's hope that these variables are meant for use inside one module only.) The conventions are about the same as those for functions.
ko: (해당 변수는 하나의 모듈 내부에서만 쓰인다고 생각하도록 하자) 이 규칙은 함수에도 동일하게 적용된다.

source: * A further issue was that annotations become part of the specification but weren't being tested.
ko: * 어노테이션은 명세에 포함되어 있으나 테스트가 이루어지지 않았다는 것 또한 문제가 되었다.

source: * Add the PEP to a local clone of the PEP repository. For mercurial workflow instructions, follow `The Python Developers Guide <http://docs.python.org/devguide>`_
ko: * PEP를 PEP 저장소의 로컬 복제본에 추가한다. 머큐리얼 작업 흐름에 대해서는 `Python 개발자 안내서 <http://docs.python.org/devguide/>`_\ 의 지침을 따른다.

source: * All function declarations and definitions must use full prototypes (i.e. specify the types of all arguments).
ko: * 모든 함수 선언 및 정의는 반드시 완전한 프로토타입을 사용한다(즉, 모든 인자의 형을 명시한다).

source: * All functions and global variables should be declared static unless they are to be part of a published interface
ko: * 이미 나와있는 인터페이스의 일부가 아닌 한, 모든 함수와 전역 변수는 정적으로 선언되어야 한다.

source: * Always put spaces around assignment, Boolean and comparison operators. In expressions using a lot of operators, add spaces around the outermost (lowest-priority) operators.
ko: * 할당, 불리언 및 비교 연산자 주위에는 항상 공백을 둔다. 연산자를 많이 사용하는 표현식에서는, (우선순위가 가장 낮은) 가장 바깥쪽 연산자 주면에 공백을 추가한다.

source: * Annotations such as ``read1(n: int=None)`` were self-contradictory since *None* is not an *int*. Annotations such as ``source_path(self, fullname:str) -> object`` were confusing about what the return type should be.
ko: * ``read1(n: int=None)`` 어노테이션은 모순적이다. None은 int가 아니기 때문이다. ``source_path(self, fullname:str) -> object``\ 와 같은 어노테이션은 반환 타입이 무엇인지 혼동할 수 있다.

source: * Assign a PEP number (almost always just the next available number, but sometimes it's a special/joke number, like 666 or 3141). (Clarification: For Python 3, numbers in the 3000s were used for Py3k-specific proposals. But now that all new features go into Python 3 only, the process is back to using numbers in the 100s again. Remember that numbers below 100 are meta-PEPs.)
ko: * PEP 번호를 할당(사용가능한 다음 번호를 붙이는 경우가 대부분이지만, 가끔은 666이나 3141처럼 특별한 번호나 장난스러운 번호를 붙이기도 한다). (설명: Python 3에서는, Py3k에 한정된 제안에 대하여 3000번대 번호를 사용했다. 그러나 이제는 모든 기능이 Python 3에만 들어가게 되었으므로, 100번대 번호를 붙이는 프로세스로 되돌려졌다. 100 아래의 번호는 메타 PEP임을 기억하라.

source: * Breaking long lines: if you can, break after commas in the outermost argument list. Always indent continuation lines appropriately, e.g.::
ko: * 긴 행을 나누기: 가능하다면, 가장 바깥쪽의 인자 리스트의 쉼표 뒤에서 행을 나눈다. 다음과 같이 항상 들여쓰기를 적절하게 사용한다. ::

source: * Code structure: one space between keywords like ``if``, ``for`` and the following left paren; no spaces inside the paren; braces may be omitted where C permits but when present, they should be formatted as shown::
ko: * 코드 구조: ``if``, ``for``\ 와 같은 키워드 뒤에 한 칸을 띄운 후에 괄호를 열고, 괄호 안쪽에는 공백을 두지 않는다. C에서 허용할 경우 괄호를 생략할 수 있으나, 괄호를 사용할 경우에는 다음과 같은 형식을 따라야 한다. ::

source: * Comments go before the code they describe.
ko: * 주석문은 해당 코드보다 먼저 오도록 한다.

source: * Commit and push the new (or updated) PEP
ko: * 새로운(또는 수정된) PEP를 commit 및 push한다.

source: * Don't use GCC extensions (e.g. don't write multi-line strings without trailing backslashes).
ko: * GCC 확장을 사용하지 않는다(예를 들어, 줄 끝에 백슬래쉬 없이 여러 줄에 걸친 문자열을 쓰지 않도록 한다).

source: * Edit the PEP for language (spelling, grammar, sentence structure, etc.), markup (for reST PEPs), code style (examples should match PEP 8 & 7).
ko: * PEP의 언어(맞춤법, 문법, 문장 구조 등), 마크업(reST PEP에 해당), 코드 스타일(PEP 8 및 7에 부합) 등에 대하여 편집한다.

source: * For external functions and variables, we always have a declaration in an appropriate header file in the "Include" directory, which uses the ``PyAPI_FUNC()`` macro, like this::
ko: * 외부 함수 및 변수에 대해서는, 우리는 항상 다음과 같이 "Include" 디렉토리 내의 ``PyAPI_FUNC()`` 매크로를 사용하는 적절한 헤더 파일에 그 정의를 둔다. ::

source: * Function and macro call style: ``foo(a, b, c)`` -- no space before the open paren, no spaces inside the parens, no spaces before commas, one space after each comma.
ko: * 함수 및 매크로 호출 스타일: ``foo(a, b, c)`` -- 괄호 앞뒤에 공백을 두지 않으며, 쉼표 앞에는 공백을 두지 않고, 쉼표 뒤에 공백 한 칸을 둔다.

source: * Function definition style: function name in column 1, outermost curly braces in column 1, blank line after local variable declarations. ::
ko: * 함수 정의 스타일: 함수 이름을 첫 컬럼에, 가장 바깥쪽 중괄호를 첫 컬럼에 쓰고, 지역 변수 선언 후에 빈 줄을 둔다. ::

source: * In addition to the above, annotations were inconsistent in the use of concrete types versus abstract types: *int* versus *Integral* and set/frozenset versus MutableSet/Set.
ko: * 또한, 어노테이션은 구체화(concrete) 타입과 추상 타입의 사용에 있어 일관성이 없다: *int*\ 와 *Integral*, set/frozenset과 MutableSet/ Set을 들 수 있다.

source: * In most cases, the docstrings already included the type specifications and did so with greater clarity than the function annotations. In the remaining cases, the docstrings were improved once the annotations were removed.
ko: * 대부분의 경우, docstring이 이미 타입 명세에 포함되어 있었으며 함수 어노테이션보다 더 명확했다. 그 외의 경우, 어노테이션이 삭제된 후 docstring의 내용이 개선되었다.

source: * Macros should have a MixedCase prefix and then use upper case, for example: ``PyString_AS_STRING``, ``Py_PRINT_RAW``.
ko: * 매크로는 대소문자를 섞은 접두어 뒤에 대문자를 쓴다. 예: ``PyString_AS_STRING``, ``Py_PRINT_RAW``

source: * Monitor python.org to make sure the PEP gets added to the site properly. If it fails to appear, running ``make`` will build all of the current PEPs. If any of these are triggering errors, they must be corrected before any PEP will update on the site.
ko: * python.org를 모니터하여 PEP가 사이트에 적합하게 추가되었는지 확인한다. 사이트에서 보이지 않는다면, ``make``\ 를 실행하여 현재의 모든 PEP를 빌드한다. 그중 어느 것이라도 오류를 일으킨다면, PEP가 사이트에 반영되기 전에 수정하여야 한다.

source: * Never use C++ style // one-line comments.
ko: * C++ 스타일의 // 한 줄 주석문을 절대 사용하지 마라.

source: * No compiler warnings with major compilers (gcc, VC++, a few others).
ko: * 주요한 컴파일러(gcc, VC++ 등)에서 컴파일러 경고가 발생하지 않도록 하라.

source: * No line should be longer than 79 characters. If this and the previous rule together don't give you enough room to code, your code is too complicated -- consider using subroutines.
ko: * 79자를 넘기는 행이 없도록 한다. 이것과 앞의 규칙을 함께 적용했을 때 코드를 작성할 공간이 부족하다면, 당신의 코드가 너무 복잡한 것이므로 서브루틴의 사용을 고려하라.

source: * No line should end in whitespace. If you think you need significant trailing whitespace, think again -- somebody's editor might delete it as a matter of routine.
ko: * 공백으로 끝나는 행을 두지 마라. 특별한 의미를 갖는 공백을 줄 끝에 두어야겠다면, 다시 한번 생각해보기 바란다. 다른 사람이 사용하는 편집기에서는 자동으로 지워버릴 수도 있다.

source: * Occasionally an "internal" function has to be visible to the loader; we use the ``_Py`` prefix for this, e.g.: ``_PyObject_Dump``.
ko: * 가끔 "내부적인" 함수가 로더에 보여질 필요가 있는데, 이때에는 ``_PyObject_Dump``\ 와 같이 ``_Py``\ 를 붙인다.

source: * Public functions and variables use MixedCase with underscores, like this: ``PyObject_GetAttr``, ``Py_BuildValue``, ``PyExc_TypeError``.
ko: * 퍼블릭 함수와 변수는 다음과 같이 밑줄과 대소문자를 섞어 쓴다: ``PyObject_GetAttr``, ``Py_BuildValue``, ``PyExc_TypeError``.

source: * Put blank lines around functions, structure definitions, and major sections inside functions.
ko: * 함수, 구조체 정의, 그리고 함수 내의 주요 섹션의 주변에는 빈 행을 둔다.

source: * Read the PEP to check if it is ready: sound and complete. The ideas must make technical sense, even if they don't seem likely to be accepted.
ko: * PEP를 읽고 내용이 올바르고 완전하여 준비가 되었는지 점검한다. 수용되지 못할 것 같아 보이는 아이디어라 할지라도 기술적으로는 타당해야 한다.

source: * Run ``./genpepindex.py`` and ``./pep2html.py <PEP Number>`` to ensure they are generated without errors. If either triggers errors, then the web site will not be updated to reflect the PEP changes.
ko: * ``./genpepindex.py``\ 와 ``./pep2html.py <PEP Number>``\ 를 수행하여 오류 없이 생성되는지 확인한다. 프로그램이 오류를 일으킨다면, 웹사이트에는 해당 PEP의 수정사항이 반영되지 않을 것이다.

source: * Send email back to the PEP author with next steps (post to python-list & -dev).
ko: * PEP 저자에게 다음 단계와 함께 이메일을 보낸다(python-list 및 -dev에 게재).

source: * Some annotations in the abstract base classes were incorrect specifications. For example, set-to-set operations require *other* to be another instance of *Set* rather than just an *Iterable*.
ko: * 추상 기본 클래스의 어노테이션 일부는 부정확한 명세를 갖고 있다. 예를 들면, set-to-set 연산은 Set 객체를 필요로 하는데, 이는 *Iterable*\ 이 아닌 *Set* 인스턴스를 얻기 위해서이다.

source: * The annotation ``seek(whence:int)`` exhibited a mix of over-specification and under-specification: *int* is too restrictive (anything with ``__index__`` would be allowed) and it is not restrictive enough (only the values 0, 1, and 2 are allowed). Likewise, the annotation ``write(b: bytes)`` was also too restrictive (anything supporting the buffer protocol would be allowed).
ko: * ``seek(whence:int)``\ 란 어노테이션은 명세가 특정 부분에서는 제약이 심하고, 혹은 그렇지 않을 때도 있음을 보여준다: int는 지나치게 한정적이며(``__index__``\ 가 허용하는 모든 것이 허용된다), 동시에 한정적이지 않기도 하다(0, 1, 2 값만 허용된다). 마찬가지로 ``write(b: bytes)``\ 라는 어노테이션 또한 지나치게 한정적이다(버퍼 프로토콜을 허용하는 모든 값을 지원한다).

source: * The first line of each fuction docstring should be a "signature line" that gives a brief synopsis of the arguments and return value. For example::
ko: * 각 함수 문서화 문자열의 첫 줄에는, 다음과 같이 간략한 개요와 반환 값을 기술하는 "시그너쳐 행"이 오도록 해야 한다. ::

source: * The notation ``open(file:(str,bytes))`` was used for a value that could be either *bytes* or *str* rather than a 2-tuple containing a *str* value followed by a *bytes* value.
ko: * ``open(file:(str,bytes))``\ 이란 어노테이션은 *str* 다음에 *bytes* 값을 갖는 2개의 튜플을 나타내는 것이 아니라, *bytes* 혹은 *str*\ 을 가질 수 있는 값에 쓰인다.

source: * The observed function annotations were too ad-hoc and inconsistent to work with a coherent system of automatic type checking or argument validation. Leaving these annotations in the code would have made it more difficult to make changes later so that automated utilities could be supported.
ko: * 이와 같은 함수 어노테이션들은 자동 타입 검사나 인수의 검증을 수행하는 시스템에서 사용하기에는 너무 주먹구구식이고 일관성이 없었다. 이러한 어노테이션을 코드에 남겨두면 차후에 자동화된 유틸리티 등을 작성하기 위해 코드를 수정할 때 어려움을 겪을 수 있다.

source: * The return statement should *not* get redundant parentheses::
ko: * return 문에는 불필요한 괄호를 사용하지 *않는다.* ::

source: * The title should accurately describe the content.
ko: * 제목은 내용을 정확하게 기술하여야 한다.

source: * Unix-like software distributions (including systems like Mac OS X and Cygwin) should install the ``python2`` command into the default path whenever a version of the Python 2 interpreter is installed, and the same for ``python3`` and the Python 3 interpreter. * When invoked, ``python2`` should run some version of the Python 2 interpreter, and ``python3`` should run some version of the Python 3 interpreter. * Similarly, the more general ``python`` command should be installed whenever any version of Python is installed and should invoke the same version of Python as either ``python2`` or ``python3``. * For the time being, it is recommended that ``python`` should refer to ``python2`` (however, some distributions have already chosen otherwise; see the `Rationale`_ and `Migration Notes`_ below). * The Python 2.x ``idle``, ``pydoc``, and ``python-config`` commands should likewise be available as ``idle2``, ``pydoc2``, and ``python2-config``, with the original commands invoking these versions by default, but possibly invoking the Python 3.x versions instead if configured to do so by the system administrator. * In order to tolerate differences across platforms, all new code that needs to invoke the Python interpreter should not specify ``python``, but rather should specify either ``python2`` or ``python3`` (or the more specific ``python2.x`` and ``python3.x`` versions; see the `Migration Notes`_). This distinction should be made in shebangs, when invoking from a shell script, when invoking via the system() call, or when invoking in any other context. * One exception to this is scripts that are deliberately written to be source compatible with both Python 2.x and 3.x. Such scripts may continue to use ``python`` on their shebang line without affecting their portability. * When reinvoking the interpreter from a Python script, querying ``sys.executable`` to avoid hardcoded assumptions regarding the interpreter location remains the preferred approach.
ko: * Unix-like software distributions (including systems like Mac OS X and Cygwin) should install the ``python2`` command into the default path whenever a version of the Python 2 interpreter is installed, and the same for ``python3`` and the Python 3 interpreter. * When invoked, ``python2`` should run some version of the Python 2 interpreter, and ``python3`` should run some version of the Python 3 interpreter. * Similarly, the more general ``python`` command should be installed whenever any version of Python is installed and should invoke the same version of Python as either ``python2`` or ``python3``. * For the time being, it is recommended that ``python`` should refer to ``python2`` (however, some distributions have already chosen otherwise; see the `근거`_ and `Migration Notes`_ below). * The Python 2.x ``idle``, ``pydoc``, and ``python-config`` commands should likewise be available as ``idle2``, ``pydoc2``, and ``python2-config``, with the original commands invoking these versions by default, but possibly invoking the Python 3.x versions instead if configured to do so by the system administrator. * In order to tolerate differences across platforms, all new code that needs to invoke the Python interpreter should not specify ``python``, but rather should specify either ``python2`` or ``python3`` (or the more specific ``python2.x`` and ``python3.x`` versions; see the `Migration Notes`_). This distinction should be made in shebangs, when invoking from a shell script, when invoking via the system() call, or when invoking in any other context. * One exception to this is scripts that are deliberately written to be source compatible with both Python 2.x and 3.x. Such scripts may continue to use ``python`` on their shebang line without affecting their portability. * When reinvoking the interpreter from a Python script, querying ``sys.executable`` to avoid hardcoded assumptions regarding the interpreter location remains the preferred approach.

source: * Use 4-space indents and no tabs at all.
ko: * 공백 네 개의 들여쓰기를 사용하고 탭은 사용하지 않는다.

source: * Use ANSI/ISO standard C (the 1989 version of the standard). This means (amongst many other things) that all declarations must be at the top of a block (not necessarily at the top of function).
ko: * ANSI/ISO 표준 C(표준 1989 버전)를 사용하라. 이는 모든 선언이 최상위 블록에 위치하여야 함을 의미한다(함수의 상단일 필요는 없다).

source: * Use a ``Py`` prefix for public functions; never for static functions. The ``Py_`` prefix is reserved for global service routines like ``Py_FatalError``; specific groups of routines (e.g. specific object type APIs) use a longer prefix, e.g. ``PyString_`` for string functions.
ko: * 퍼블릭 함수에 대해서는 ``Py``\ 를 앞에 붙이고, 정적 함수에 대해서는 절대 그렇게 하지 않는다. ``Py_``\ 는 ``Py_FatalError``\ 와 같은 전역 서비스 루틴을 위한 것이다. 특정한 루틴 그룹(특정한 개체 유형 API 등)은 보다 긴 접두어를 사용하는데, 문자열 함수에 ``PyString_``\ 을 붙이는 것을 예로 들 수 있다.

source: * Use the ``PyDoc_STR()`` or ``PyDoc_STRVAR()`` macro for docstrings to support building Python without docstrings (``./configure --without-doc-strings``).
ko: * ``PyDoc_STR()`` 또는 ``PyDoc_STRVAR()`` 매크로를 사용함으로써, 문서화 문자열 없이 파이썬을 빌드(``./configure --without-doc-strings``)할 수 있도록 지원한다.

source: * When writing multi-line docstrings, be sure to always use backslash continuations, as in the example above, or string literal concatenation::
ko: * 여러 줄에 걸친 문서화 문자열을 작성할 때에는, 위와 같이 백슬래쉬를 사용하여 연결하거나, 다음과 같이 문자열 리터럴 접속을 사용한다. ::

source: * When you break a long expression at a binary operator, the operator goes at the end of the previous line, e.g.::
ko: * 긴 행을 이항 연산자가 있는 곳에서 나눌 때는, 다음과 같이 윗줄의 끝에 연산자가 오도록 한다. ::

source: * `Following Python's Development <http://docs.python.org/devguide/communication.html>`_
ko: * `Python 개발 따라잡기 <http://docs.python.org/devguide/communication.html>`_

source: * `Frequently Asked Questions for Developers <http://docs.python.org/devguide/faq.html>`_
ko: * `개발자들을 위한 자주 묻는 질문 <http://docs.python.org/devguide/faq.html>`_

source: * `Index of Python Enhancement Proposals <http://www.python.org/dev/peps/>`_
ko: * `Python 개선 제안 색인 <http://www.python.org/dev/peps/>`_

source: * `Python Developer's Guide <http://docs.python.org/devguide/>`_
ko: * `Python 개발자 안내서 <http://docs.python.org/devguide/>`_

source: * ``[str]`` was ambiguous as to whether it represented a list of strings or a value that could be either *str* or *None*.
ko: * ``[str]``\ 은 이 어노테이션이 문자열 리스트를 나타내는지, str 혹은 None 타입의 값을 나타내는지 모호하다.

source: *Note: The Resolution header is required for Standards Track PEPs only. It contains a URL that should point to an email message or other web resource where the pronouncement about the PEP is made.*
ko: *참고: Resolution 헤더는 표준 트랙 PEP에 한하여 필요하다. PEP가 만들어진 것에 대하여 공식적으로 밝힌 이메일 주소 또는 다른 웹 자원을 가리키는 URL을 포함한다.*

source: - Added some `References`_.
ko: - Added some `참조`_.

source: - Additionally, for all try/except clauses, limit the ``try`` clause to the absolute minimum amount of code necessary. Again, this avoids masking bugs.
ko: - 또한, try/except 절을 사용할 때에는 ``try`` 절이 적용되는 코드의 범위를 최소화해야 한다. 이는 버그가 겹치는 일을 막아준다.

source: - Always surround these binary operators with a single space on either side: assignment (``=``), augmented assignment (``+=``, ``-=`` etc.), comparisons (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), Booleans (``and``, ``or``, ``not``).
ko: - 항상 이진 연산자의 주위에는 한 개의 공백을 넣는다: 할당 (``=``), 증감 할당 (``+=``, ``-=`` 등.), 비교 (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), 부울 연산 (``and``, ``or``, ``not``).

source: - Clarified Abstract_, Motivation_, `Reference Implementation`_ and `Open Issues`_ based on the simultaneous concepts of ``Max`` and ``Min``.
ko: - Clarified 초록_, Motivation_, `Reference Implementation`_ and `Open Issues`_ based on the simultaneous concepts of ``Max`` and ``Min``.

source: - Code should be written in a way that does not disadvantage other implementations of Python (PyPy, Jython, IronPython, Cython, Psyco, and such).
ko: - 파이썬 코드는 다른 파이썬 구현(PyPy, Jython, IronPython, Cython, Psyco 등)에서 손해를 보지 않는 방식으로 구현하여야 한다.

source: - Comparisons to singletons like None should always be done with ``is`` or ``is not``, never the equality operators.
ko: - None과 같은 싱글턴 객체에 대해 비교 연산을 할 때에는 항상 ``is`` 혹은 ``is not`` 키워드를 사용하며, 동등 비교 연산자를 사용해선 안된다.

source: - Compound statements (multiple statements on the same line) are generally discouraged.
ko: - 복합 구문(Compound statements, 여러 구문이 한 줄에 있는 것)은 일반적으로 권장되지 않는다.

source: - Context managers should be invoked through separate functions or methods whenever they do something other than acquire and release resources. For example:
ko: - 리소스의 점유/해제 외의 작업을 제외하고, 어떤 작업을 할 때든지 별도의 함수/메서드를 통해 문맥(context) 관리자를 호출해야 한다. 예를 들면:

source: - Don't compare boolean values to True or False using ``==``. ::
ko: - ``==``\ 를 사용해서 True/False 값을 부울 값과 비교하지 않는다.

source: - Don't use spaces around the ``=`` sign when used to indicate a keyword argument or a default parameter value.
ko: - 키워드 인수 혹은 기본 매개변수 값을 나타내는 경우에는 ``=`` 기호 주위에 공백을 넣지 않는다.

source: - Don't write string literals that rely on significant trailing whitespace. Such trailing whitespace is visually indistinguishable and some editors (or more recently, reindent.py) will trim them.
ko: - 공백 문자가 뒤에 따라오는 문자 상수를 사용하지 않는다. 이렇게 뒤에 붙은 공백 문자는 눈에 잘 띄지 않으며, 일부 편집기(혹은 최신의 reindent.py)에서는 이러한 공백 문자를 제거한다.

source: - For one liner docstrings, it's okay to keep the closing ``"""`` on the same line.
ko: - 한 줄 짜리 docstring의 경우에는 같은 줄에서 ``"""``\ 를 닫아도 된다.

source: - For sequences, (strings, lists, tuples), use the fact that empty sequences are false. ::
ko: - 배열 형태의 타입(문자열, 리스트, 튜플)은 그 내용이 비어있을 때 false를 반환한다는 사실을 활용한다. ::

source: - For simple public data attributes, it is best to expose just the attribute name, without complicated accessor/mutator methods. Keep in mind that Python provides an easy path to future enhancement, should you find that a simple data attribute needs to grow functional behavior. In that case, use properties to hide functional implementation behind simple data attribute access syntax.
ko: - 간단한 public 데이터 어트리뷰트의 경우, 복잡한 접근자/변경자 메서드 대신 어트리뷰트 이름을 직접 노출하는 방법이 가장 좋다. 파이썬은 향후 개선에 대하여 가장 쉬운 방법을 제공하며, 기능이 늘어날 수록 간단한 데이터 어트리뷰트가 필요하다는 것을 알아야 한다. 이런 경우, 프로퍼티를 사용하여 실제 기능 구현을 숨기고 사용자는 간단한 데이터 어트리뷰트에 접근하는 문법을 사용할 수 있도록 한다.

source: - If operators with different priorities are used, consider adding whitespace around the operators with the lowest priority(ies). Use your own judgement; however, never use more than one space, and always have the same amount of whitespace on both sides of a binary operator.
ko: - 우선 순위가 서로 다른 연산자를 함께 사용할 경우, 우선 순위가 낮은 연산자 주위에 공백을 넣을지 고려해보자. 하지만 이 경우에도 한 개를 초과하는 공백 문자를 사용하면 안 되며, 이진 연산자의 양쪽을 똑같은 방식으로 기술하도록 한다.

source: - If your class is intended to be subclassed, and you have attributes that you do not want subclasses to use, consider naming them with double leading underscores and no trailing underscores. This invokes Python's name mangling algorithm, where the name of the class is mangled into the attribute name. This helps avoid attribute name collisions should subclasses inadvertently contain attributes with the same name.
ko: - 부모 클래스를 디자인하면서 특정 어트리뷰트가 상속되지 않도록 하고 싶다면, 이들 어트리뷰트의 이름 앞에 두 개의 언더스코어를 붙이는 것을 고려해보자. 이렇게 하면 파이썬의 네임 맹글링 기능을 사용하게 되며, 어트리뷰트 이름 앞에 클래스의 이름이 맹글링된다. 이 기능은 자식 클래스가 우연히 동일한 어트리뷰트 이름을 사용했을 때 어트리뷰트 이름 충돌이 일어나는 것을 막아준다.

source: - If your public attribute name collides with a reserved keyword, append a single trailing underscore to your attribute name. This is preferable to an abbreviation or corrupted spelling. (However, notwithstanding this rule, 'cls' is the preferred spelling for any variable or argument which is known to be a class, especially the first argument to a class method.)
ko: - public 어트리뷰트의 이름이 예약어와 충돌할 경우, 어트리뷰트 이름의 끝에 언더스코어 문자 하나를 추가한다. 약어나 틀린 맞춤법을 사용하 는 대신 이 방식을 권장한다. (이 규칙과는 상관 없이, 'cls'는 변수 혹은 인수에서 클래스를 나타내는데 적절한 단어이며, 특히 클래스 메 서드의 첫 번째 인수로 쓰인다.)

source: - Immediately before a comma, semicolon, or colon::
ko: - 콤마, 세미콜론, 콜론의 이전 위치::

source: - Immediately before the open parenthesis that starts an indexing or slicing::
ko: - 인덱싱 혹은 슬라이싱이 시작되는 괄호의 바로 이전 위치::

source: - Immediately before the open parenthesis that starts the argument list of a function call::
ko: - 함수 호출시 인수 목록이 시작되는 괄호의 바로 이전 위치::

source: - Immediately inside parentheses, brackets or braces. ::
ko: - 괄호, 중괄호, 대괄호 내부에 연결되는 부분::

source: - Imports are always put at the top of the file, just after any module comments and docstrings, and before module globals and constants.
ko: - 임포트 구문은 항상 파일의 최상단에 위치해야 하며, 모듈의 주석문과 docstring의 바로 다음, 그리고 모듈의 전역 변수와 상수 바로 이전에 위치한다.

source: - Imports should usually be on separate lines, e.g.::
ko: - 임포트는 보통 행으로 구분되어야 한다. 예를 들면, ::
